# PEP-8 !!!
# PEP-257 - для строк документации
# 1. Дополнительные пробелы в скобках - избегаем
x = [ '2 ' , 3 , 5 ]  # некорректно

# 2. Пробелы вокруг арифметических операций - они нужны!
a=1+2+3*9  # некорректно

# 3. Имена переменных и функций
# MyVar, myVar, Var, Myfunc, MyFunc -- некорретно
# var, my_var, func, my_func -- корректно

# 4. Оформление блоков кода
# Четыре пробела !!

# 5. Комбинирование апострофов и кавычек
my_string = "string"
my_string1 = 'string "this"'
"this is my string - 'text'"
